
function ionic_liquid_coil_ode!(du,u, p, t)
    # ωₐᵢᵣ, iₐᵢᵣ, ṁₛₒₗ,ξₛₒₗ, iₛₒₗ = u
    # ========================================
    IL = p[1]
    H = p[2]
    Le = p[3]
    ∂Qᵣ = p[4]
    ṁₐᵢᵣ = p[5]
    NTUᴰₐᵢᵣ = p[6]
    σ = p[7]
    # ========================================
    Tₛₒₗ = calculate_T(u[5],u[4], IL)
    Pᵥₐₚₒᵣ_ₛₒₗᵛ = Pᵥₐₚₒᵣ_ₛₒₗ(Tₛₒₗ,u[4])
    ωₑ = 0.622 * Pᵥₐₚₒᵣ_ₛₒₗᵛ / (101325.0 - Pᵥₐₚₒᵣ_ₛₒₗᵛ)
    iₑ = 1.01 * (Tₛₒₗ - 273.15) + ωₑ * (2500 + 1.04 * (Tₛₒₗ - 273.15))
    iₑ *= 1000
    iᵥₐₚₒᵣ_ₜₛ = i_vapor_saturation(Tₛₒₗ)

    du[1] = p[7] * (p[6] / p[2]) * (u[1] - ωₑ)
    du[2] = p[7] * (p[6] * p[3] / p[2]) * ((u[2] - iₑ) + (iᵥₐₚₒᵣ_ₜₛ * (1 / p[3] - 1) * (u[1] - ωₑ)))
    du[3] = p[7] * p[5] * du[1]
    du[4] = (-u[4] / u[3]) * du[3]
    du[5] = (1 / u[3]) * (p[7] * p[5] * du[2] - u[5] * du[3] - p[4])
    nothing
end
# ω_end =  0.01782, i_end = 75725.5949 air
# ṁs0= 0.0006004891705935622, ξ0= 0.7, i0 = -74600.0
function bca!(res_a, u_a, p)
    res_a[1] = u_a[3] - 0.0006004891705935622
    res_a[2] = u_a[4] - 0.74
    res_a[3] = u_a[5] + 74600.0
    nothing
end
function bcb!(res_b, u_b, p)
    res_b[1] = u_b[1] - 0.01782
    res_b[2] = u_b[2] - 75725.5949
    nothing
end